Catalogs/Renault_КартыЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_КартыЛояльности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПрограммыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DMS_ВидКартыЛояльности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ВидыКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DMS_ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DMS_КартаЗамены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/DMS_ТипыКартЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ТипыКартЛояльности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонусная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Renault_КартыЛояльности/Forms/ФормаВыбораУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагент") Тогда
		КонтрагентОтбор = Параметры.Контрагент;
	ИначеЕсли Параметры.Отбор.Свойство("Контрагент") Тогда 
		УдалитьЭлементОтбораДинамическогоСписка(Список,"Контрагент");
		КонтрагентОтбор = Параметры.Отбор.Контрагент;
		ИспользоватьОтборКонтрагент = Истина;
	КонецЕсли; 
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли; 
	
	Если Параметры.Свойство("ТипКарты") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТипКарты",Параметры.ТипКарты);
	Иначе 
		Список.Параметры.УстановитьЗначениеПараметра("ТипКарты",Перечисления.DMS_ТипыКартЛояльности.ПустаяСсылка());
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(КонтрагентОтбор) Тогда
		
		ИспользоватьОтборКонтрагент = ЗначениеЗаполнено(КонтрагентОтбор);
		
		БонуснаяКартаОтбор = НайтиБонуснуюКартуКлиента(КонтрагентОтбор);
		
		Если ЗначениеЗаполнено(БонуснаяКартаОтбор) Тогда
			
			ИспользоватьБонуснаяКартаОтбор = ЗначениеЗаполнено(БонуснаяКартаОтбор);
			
			УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",БонуснаяКартаОтбор,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(БонуснаяКартаОтбор));
			УстановитьЭлементОтбораДинамическогоСписка(Список,"Контрагент",КонтрагентОтбор,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(КонтрагентОтбор));
		Иначе 
			УстановитьЭлементОтбораДинамическогоСписка(Список,"Контрагент",КонтрагентОтбор,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(КонтрагентОтбор));
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Не ЗначениеЗаполнено(КонтрагентОтбор) Тогда
		КонтрагентОтбор = ЗначениеОтбораСпискаПоИмени(Список.Отбор,"Контрагент");
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(БонуснаяКартаОтбор) Тогда
		БонуснаяКартаОтбор = ЗначениеОтбораСпискаПоИмени(Список.Отбор,"Ссылка");
	КонецЕсли; 
	
КонецПроцедуры // ПриОткрытииНаСервере()

&НаСервере
Функция ЗначениеОтбораСпискаПоИмени(ОбластьПоиска,ИмяПоля = Неопределено,Представление = Неопределено)
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Если МассивЭлементов.Количество() > 0 Тогда
		
		Возврат МассивЭлементов[0].ПравоеЗначение;
	
	КонецЕсли; 
	
КонецФункции // ЗначениеОтбораСпискаПоИмени()

&НаКлиенте
Процедура БонуснаяКартаОтборПриИзменении(Элемент)
	
	ИспользоватьБонуснаяКартаОтбор = ЗначениеЗаполнено(БонуснаяКартаОтбор);
	БонуснаяКартаОтборПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура БонуснаяКартаОтборПриИзмененииНаСервере()
	
	УдалитьЭлементОтбораДинамическогоСписка(Список,"Ссылка");
	
	Если ЗначениеЗаполнено(БонуснаяКартаОтбор) Тогда
		УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",БонуснаяКартаОтбор,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(БонуснаяКартаОтбор));
	КонецЕсли; 
		
КонецПроцедуры // БонуснаяКартаОтборПриИзмененииНаСервере()
 
&НаКлиенте
Процедура КонтрагентОтборПриИзменении(Элемент)
	
	ИспользоватьОтборКонтрагент = ЗначениеЗаполнено(КонтрагентОтбор);
	
	КонтрагентОтборПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентОтборПриИзмененииНаСервере()
	
	УдалитьЭлементОтбораДинамическогоСписка(Список,"Контрагент");
	
	Если ЗначениеЗаполнено(КонтрагентОтбор) Тогда
		УстановитьЭлементОтбораДинамическогоСписка(Список,"Контрагент",КонтрагентОтбор,ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(КонтрагентОтбор));
	КонецЕсли; 
		
КонецПроцедуры // КонтрагентОтборПриИзмененииНаСервере()

&НаКлиенте
Процедура НомерБонуснойКартыОтборПриИзменении(Элемент)
	НомерБонуснойКартыОтборПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура НомерБонуснойКартыОтборПриИзмененииНаСервере()

	УдалитьЭлементОтбораДинамическогоСписка(Список,"Код");	
	
	Если Не ПустаяСтрока(НомерБонуснойКартыОтбор) Тогда
		УстановитьЭлементОтбораДинамическогоСписка(Список,"Код",НомерБонуснойКартыОтбор,ВидСравненияКомпоновкиДанных.Содержит,,ЗначениеЗаполнено(НомерБонуснойКартыОтбор));
	КонецЕсли; 
	
КонецПроцедуры // НомерБонуснойКартыОтборПриИзмененииНаСервере()

&НаКлиенте
Процедура ПереключательПерсонализированаОтборПриИзменении(Элемент)
	ПереключательПерсонализированаОтборПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ПереключательПерсонализированаОтборПриИзмененииНаСервере()
	
	Если ПереключательПерсонализированаОтбор = 0 Тогда
		УдалитьЭлементОтбораДинамическогоСписка(Список,"Персонализирована");	
	ИначеЕсли ПереключательПерсонализированаОтбор = 1 Тогда
		УстановитьЭлементОтбораДинамическогоСписка(Список,"Персонализирована",Истина,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли ПереключательПерсонализированаОтбор = 2 Тогда
		УстановитьЭлементОтбораДинамическогоСписка(Список,"Персонализирована",Ложь,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли; 
	
КонецПроцедуры // ПереключательПерсонализированаОтборПриИзмененииНаСервере()

&НаСервереБезКонтекста
Функция НайтиБонуснуюКартуКлиента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	Renault_КартыЛояльности.Ссылка
		|ИЗ
		|	Справочник.Renault_КартыЛояльности КАК Renault_КартыЛояльности
		|ГДЕ
		|	Renault_КартыЛояльности.Контрагент = &Контрагент
		|	И НЕ Renault_КартыЛояльности.ПометкаУдаления
		|	И НЕ Renault_КартыЛояльности.Недействительна
		|	И Renault_КартыЛояльности.DMS_ТипКарты = ЗНАЧЕНИЕ(Перечисление.DMS_ТипыКартЛояльности.Бонусная)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКарт = РезультатЗапроса.Выбрать();
	
	КартаЛояльности = Справочники.Renault_КартыЛояльности.ПустаяСсылка();
	
	Если ВыборкаКарт.Следующий() И ВыборкаКарт.Количество() = 1 Тогда
		КартаЛояльности = ВыборкаКарт.Ссылка;	
	КонецЕсли; 
	
	Возврат КартаЛояльности;
	
КонецФункции // НайтиБонуснуюКартуКлиента()

&НаСервере
Процедура УстановитьЭлементОтбораДинамическогоСписка(ДинамическийСписок, ИмяПоля,
	ПравоеЗначение = Неопределено,
	ВидСравнения = Неопределено,
	Представление = Неопределено,
	Использование = Неопределено,
	РежимОтображения = Неопределено,
	ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Если РежимОтображения = Неопределено Тогда
		РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	ОтборДинамическогоСписка = ДинамическийСписок.Отбор;
	
	//Если РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
	//	ОтборДинамическогоСписка = ДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	//Иначе
	//	ОтборДинамическогоСписка = ДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор;
	//КонецЕсли;
		
	УстановитьЭлементОтбора(
		ОтборДинамическогоСписка,
		ИмяПоля,
		ПравоеЗначение,
		ВидСравнения,
		Представление,
		Использование,
		РежимОтображения,
		ИдентификаторПользовательскойНастройки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлементОтбора(ОбластьПоискаДобавления,
								Знач ИмяПоля,
								Знач ПравоеЗначение = Неопределено,
								Знач ВидСравнения = Неопределено,
								Знач Представление = Неопределено,
								Знач Использование = Неопределено,
								Знач РежимОтображения = Неопределено,
								Знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	ЧислоИзмененных = ИзменитьЭлементыОтбора(ОбластьПоискаДобавления, ИмяПоля, Представление,
							ПравоеЗначение, ВидСравнения, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки);
	
	Если ЧислоИзмененных = 0 Тогда
		Если ВидСравнения = Неопределено Тогда
			Если ТипЗнч(ПравоеЗначение) = Тип("Массив")
				Или ТипЗнч(ПравоеЗначение) = Тип("ФиксированныйМассив")
				Или ТипЗнч(ПравоеЗначение) = Тип("СписокЗначений") Тогда
				ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
		КонецЕсли;
		Если РежимОтображения = Неопределено Тогда
			РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
		ДобавитьЭлементКомпоновки(ОбластьПоискаДобавления, ИмяПоля, ВидСравнения,
								ПравоеЗначение, Представление, Использование, РежимОтображения, ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементКомпоновки(ОбластьДобавления,
									Знач ИмяПоля,
									Знач ВидСравнения,
									Знач ПравоеЗначение = Неопределено,
									Знач Представление  = Неопределено,
									Знач Использование  = Неопределено,
									знач РежимОтображения = Неопределено,
									знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Элемент = ОбластьДобавления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения = ВидСравнения;
	
	Если РежимОтображения = Неопределено Тогда
		Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		Элемент.РежимОтображения = РежимОтображения;
	КонецЕсли;
	
	Если ПравоеЗначение <> Неопределено Тогда
		Элемент.ПравоеЗначение = ПравоеЗначение;
	КонецЕсли;
	
	Если Представление <> Неопределено Тогда
		Элемент.Представление = Представление;
	КонецЕсли;
	
	Если Использование <> Неопределено Тогда
		Элемент.Использование = Использование;
	КонецЕсли;
	
	// Важно: установка идентификатора должна выполняться
	// в конце настройки элемента, иначе он будет скопирован
	// в пользовательские настройки частично заполненным.
	Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
	ИначеЕсли Элемент.РежимОтображения <> РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		Элемент.ИдентификаторПользовательскойНастройки = ИмяПоля;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

&НаСервере
Функция ИзменитьЭлементыОтбора(ОбластьПоиска,
								Знач ИмяПоля = Неопределено,
								Знач Представление = Неопределено,
								Знач ПравоеЗначение = Неопределено,
								Знач ВидСравнения = Неопределено,
								Знач Использование = Неопределено,
								Знач РежимОтображения = Неопределено,
								Знач ИдентификаторПользовательскойНастройки = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если ИмяПоля <> Неопределено Тогда
			Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
		Если Представление <> Неопределено Тогда
			Элемент.Представление = Представление;
		КонецЕсли;
		Если Использование <> Неопределено Тогда
			Элемент.Использование = Использование;
		КонецЕсли;
		Если ВидСравнения <> Неопределено Тогда
			Элемент.ВидСравнения = ВидСравнения;
		КонецЕсли;
		Если ПравоеЗначение <> Неопределено Тогда
			Элемент.ПравоеЗначение = ПравоеЗначение;
		КонецЕсли;
		Если РежимОтображения <> Неопределено Тогда
			Элемент.РежимОтображения = РежимОтображения;
		КонецЕсли;
		Если ИдентификаторПользовательскойНастройки <> Неопределено Тогда
			Элемент.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЭлементов.Количество();
	
КонецФункции

&НаСервере
Процедура НайтиРекурсивно(КоллекцияЭлементов, МассивЭлементов, СпособПоиска, ЗначениеПоиска)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если СпособПоиска = 1 Тогда
				Если ЭлементОтбора.ЛевоеЗначение = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			ИначеЕсли СпособПоиска = 2 Тогда
				Если ЭлементОтбора.Представление = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			НайтиРекурсивно(ЭлементОтбора.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
			
			Если СпособПоиска = 2 И ЭлементОтбора.Представление = ЗначениеПоиска Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементОтбораДинамическогоСписка(ДинамическийСписок, ИмяПоля,РежимОтображения = Неопределено)
	
	Если РежимОтображения = Неопределено Тогда
		РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	ОтборДинамическогоСписка = ДинамическийСписок.Отбор;
	
	//Если РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
	//	ОтборДинамическогоСписка = ДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	//Иначе
	//	ОтборДинамическогоСписка = ДинамическийСписок.КомпоновщикНастроек.Настройки.Отбор;
	//КонецЕсли;
		
	ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОтборДинамическогоСписка.Элементы, МассивЭлементов, 1, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		ОтборДинамическогоСписка.Элементы.Удалить(Элемент);
	КонецЦикла;
	
КонецПроцедуры // УдалитьЭлементОтбораДинамическогоСписка()

&НаКлиенте
Процедура ИспользоватьОтборКонтрагентПриИзменении(Элемент)
	ИспользоватьОтборКонтрагентПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ИспользоватьОтборКонтрагентПриИзмененииНаСервере()
	
	УдалитьЭлементОтбораДинамическогоСписка(Список,"Контрагент");
	
	Если ИспользоватьОтборКонтрагент Тогда
		УстановитьЭлементОтбораДинамическогоСписка(Список,"Контрагент",КонтрагентОтбор,ВидСравненияКомпоновкиДанных.Равно,,ИспользоватьОтборКонтрагент);
	КонецЕсли; 	
	
КонецПроцедуры // ИспользоватьОтборКонтрагентПриИзмененииНаСервере()

&НаКлиенте
Процедура ИспользоватьБонуснаяКартаОтборПриИзменении(Элемент)
	ИспользоватьБонуснаяКартаОтборПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьБонуснаяКартаОтборПриИзмененииНаСервере()
	
	УдалитьЭлементОтбораДинамическогоСписка(Список,"Ссылка");
	
	Если ИспользоватьБонуснаяКартаОтбор Тогда
		УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",БонуснаяКартаОтбор,ВидСравненияКомпоновкиДанных.Равно,,ИспользоватьБонуснаяКартаОтбор);
	КонецЕсли; 
	
КонецПроцедуры
